#Дано текстовый файл, що вміщає довільний тест. Користувач вводить два слова, word1 та word2.
#Необхідно розробити застосунок, що знайде у текстовому файлі всі появи word1 та замінить їх на word2.
text = ''
while text == '':
    try:
        file = input('Введіть назву файлу, у форматі "name.txt"')
        text = open(file, 'r', encoding='utf-8').read()
    except:
        print('Спробуйте ще раз')
        
word1 = input('Введіть перше слово(яке замінювати, враховуючи регістр букв)')
word2 = input('Введіть друге слово(на яке замінюватиметься)')

text = text.replace(word1, word2)

open(file, 'w').write(text)
